[
	{
		"title": "Dash Cam",
		"page": "dash-cam",
		"type": "project",
		"content": [
			"- <a href='media/dashcam/box.jpg' target='_blank'>link to hq box image</a>",
			"my dad bought this dash cam a couple of years ago, it claims many things of which many are untrue, but to be fair - it's pretty neat it works to the extent it does however considering the 14.95€ price point. i am not able to find any information about it via. the part numbers - although my search wasn't so thorough i am puzzled by my lack of findings. i will be loosely documenting this product and it's internals for the sake of archiving.",

			"<h1>accessories</h1><img src='media/dashcam/accessories.png'>",
			"inside the packaging, there is a suction-cup stand for the unit and only one usb mini cable. (which i presume is charging only, but am too lazy to test) the stand has a lever, (A) which when switched to the downward position, pulls the bottom of the suction cup upwards creating suction which holds the unit firmly in place.",
			"the stand also has a 'thumbscrew' (B) that adjusts the sensitivity of the head of the stand - at no point does the thumb screw completely stop the head from moving when tightened or completely loosen it when loosed. (the camera unit is so light that even when the head is perpendicular to the stand it remains stationary)",

			"<h1>overview</h1><img src='media/dashcam/overview.png'>",
			"talking about the unit itself; it has an incredibly short battery life, which i doubt is longer then 15 minutes if not 5, requiring it to be plugged in during use.",
			"this camera can be operated in two modes; recording (the default mode, press ok to cancel when turning the unit on, or to start recording) and photo. (press ok to take a photo) the images and videos stored on the inserted sd card have proper creation dates but do not contain any metadata other than that.  ",
			"you can access the settings menu by pressing the menu button, in the settings this camera has three quality modes; VGA, 720, and 1080. VGA records in 640x480, 720 in 1280x720, and 1080 is identical to VGA. you can also set the date and some other unimportant options.",

			"<h1>physical discrepancies</h1><img src='media/dashcam/discrepancies.png'>",
			"starting with the most noticeable, the screen has a 4:3 aspect ratio as opposed to the 16:9 on the packaging (the screen is also nowhere near the quality or resolution it appears as on the packaging) - and there is no AV or HDMI ports nor markings present on the device. the camera lens does not 'bubble' out of the case as it does on the packaging.",

			"<h1>conclusion</h1>",
			"i doubt there is any way to reprogram the onboard microcontroller, of which i could not find a datasheet, (24DC, MO(Q?)SR235 . 1, 1811) so the unit cannot be repurposed in that way",
			"after disassembling, i can only see a few components that could be worth salvaging; the camera, display, (i could not find datasheets for either of those, however) the leds, (which im pretty sure are just white and not infrared) the speaker, (potentially of decent quality, the unit plays a tinny tune when turned on or off, but i can't tell if it's a limitation of the speaker or the microcontroller of the unit itself and am not willing to test) micro sd card slot, mini usb port, microphone, tactile buttons, potentially the ribbon cable connectors, potentially some ics, and potentially the battery. (a li-ion which seems a little inflated, and with no discernible charge controller on the outside of the battery)",
			"the screws could also be useful, but are a little small. the case might be able to be reused for another project but it is very small and unlikely to be useful for much. it is about 14mm (36mm including the lens unit) in depth, 85mm in width, and 48mm in height. it could fit a raspberry pi zero inside.",

			"<h1>teardown: case</h1><img src='media/dashcam/teardown-case.png'>",
			"to disassemble the case to get access to the inside of the camcorder, i must remove the 'glass' that covers the screen, remove two screws from the top and from the bottom of the device. taking a prying tool (i will be using a small flathead screwdriver) and placing it into the micro usb port, being careful to not place it into the metal component on the circuit board, but the actual gap between the the top of it and the case, then i pushed down on the lever i have created. i continue to pry around the case in the new gaps that appear until the 'glass' pops off.",

			"<h1>teardown: display</h1><img src='media/dashcam/teardown-display.png'>",
			"the display is a little tricky to separate, there is a sticky piece of foam holding it in place, and there is no backing to the external frame of the lcd, leaving the initial white plastic sheet of the backlight to stick to the foam. once i have unstuck the display from the circuit board, i disconnect the ribbon cable and the display comes completely free. the markings on the ribbon cable read \"RXC-9225G-QM HLGD-HS122-01-22PIN\" (there are 22 pins on the ribbon cable)",

			"<h1>teardown: mobo</h1><img src='media/dashcam/teardown-mobo.png'>",
			"- <a href='media/dashcam/hq-mobo-back.jpg' target='_blank'>hq circuit board back image</a><br>- <a href='media/dashcam/hq-mobo-front.jpg' target='_blank'>hq circuit board front image</a>",
			"there are only two screws holding the 'mother board' in place. after those are unscrewed, i disconnect the other ribbon which goes to the camera and make sure it is separated from the sticky foam in the back, then i unstick the foam from the bottom of the case and lift the circuit board out. you could also separate the battery or the speaker cables from the foam too.",
			
			"<h1>teardown: camera</h1>(this picture will also be referenced in the next teardown section)",
			"<img src='media/dashcam/teardown-camera.png'>",
			"to remove the camera from the case, ill have to unscrew the screw A (which is slightly longer then all of the other screws) which will then allow me to lift the camera out of the case by the corners of the aluminum backplate. it is slightly hard to read on the image but the markings on the ribbon cable of the camera read \"YXK-T445 03\" with some kind of symbol underneath (it resembled an infinity sign in a box)",
			"<img src='media/dashcam/camera.png'>",

			"<h1>teardown: etc</h1>",
			"referring back to the previous image; you can take out the plastic buttons (C) that are on the bottom of the camera, it is actually one plastic part as opposed to many separate buttons. you can also unscrew the lens unit (B) and take it off.",
			"<img src='media/dashcam/teardown-etc.jpg'>"
		],
		"date": "Sat, 04 Jul 2020 02:41:16 GMT",
		"image": "src/img/media/dash_cam.png"
	},
	{
		"title": "Archiving",
		"page": "archiving-2020",
		"type": "text",
		"content": [
			"i have finally finished writing some articles documenting some of my favorite earlier work (circa 2015) that i have had saved and collecting dust in my MEGA drive, and now have written up on for your viewing pleasure",
			"you can look through them either by just scrolling down on the main/listing page or sorting by the old tag specifically"
		],
		"date": "Mon, 06 Apr 2020 01:22:13 GMT",
		"image": "src/img/media/archive.png"
	},
	{
		"title": "HyperJam",
		"page": "jam-hyperjam-4-2020",
		"type": "project",
		"content": [
			"from april 3rd through april 5th, the people over at <a class='external' href='https://merveilles.town'>merveilles</a> hosted an interactive art jam on the mastodon fediverse. the rules were: it had to be black and white, it had to be interactive, and it had to be five minutes long and under 5mb. it was recommended to use hypercard 2.4 on a macintosh plus/ii.",
			"i started off by translating a 3D engine i made on <a class='external' href='https://codepen.io/zvava/pen/WNbZPmR'>codepen</a> in javascript to hypertalk, i didn't get to implementing backface culling and shading though. (not enough time) to make it interactive i added a short spooky/\"horror-like\" story that isn't really good but i mean i can't really do anything cool in 3D as i need to make the models by each vertex and face plus it take forever to render at original speed.",
			"in the folder of .dsks linked below, backup6_trapping_finished_final_final_final.dsk is the release you should play."
		],
		"date": "Sun, 05 Apr 2020 16:18:16 GMT",
		"image": "media/hyperjam_title_card.png",
		"imagew": "320px",
		"url": "files/hyperjam/",
		"rawurl": true
	},
	{
		"title": "Website Redesign",
		"page": "website-redesign2020",
		"content": [
			"i have decided to rewrite my website after i felt like it was a bit too bloated (even though it was actually quite lightweight) and i thought it looked a little outdated already and i also wanted to add a blog to it as well.",
			"the new look of the website is supposed to look cool, detailed, and hack-ery, all while remaining lightweight and small and i feel like in that aspect i've achieved my goal. and it requires much less code to make responsive and work well on mobile this time around (the unminified css is now 4kb compared to 9.1kb originally!!)",
			"my blog is actually (as of writing) a single json file that is parsed by the user and boom is displayed as either a list of all of the posts or as a post depending on if the ?page get parameter is passed to media.html, i feel like this is alright for now cause i want it to be fun to update my blog and not a chore to compile static pages - which i am debating on doing if i can automate it well enough with my limited skillset :p"],
		"type": "text",
		"date": "Fri, 27 Mar 2020 01:55:15 GMT",
		"image": "src/img/media/redesign.png"
	},
	{
		"title": "Rewriting groinfrick",
		"page": "rewriting-groinfrick",
		"content": [
			"groinfrick was a project i started back in december of 2017, and i had either finished it then or on the june of 2018. either way back then i was much less experienced in javascript and i would say i had a much worse coding style but honestly it wasn't that bad (for my standards at least, lol)",
			"the intention of the project was (originally) to write an extended version of <a class='external' href='https://esolangs.org/wiki/Brainfuck'>brainfuck</a>, i didn't think it was that important to be backwards compatable or something so i wrote the original eight commands in a way that breaks compatability - i also didn't fully grasp ascii at that time and i wrote my own \"type systen\" for groinfrick (needless to say this also broke backwards compatability)",
			"i decided to rewrite groinfrick on the march of 2020 with my better understanding of javascripts and other fundamental concepts. firstly, i rewrote the specs to implement the core brainfuck components first and add a set of extended components (that matched my old specification) after. once i finally got the brainfuck compatability to work it was a cakewalk to add the remaining extended functions, some of which exist for debugging and i have already added during the first phase...",
			"honestly, im not that good of a brainfuck programmer so i struggled to write any examples by myself for groinfrick, and really i can't see that much of a use for the extra loops and return functions i added but hey - it's all about the journey, not the destination, and boy am i proud of this project."],
		"type": "project",
		"date": "Wed, 25 Mar 2020 02:42:37 GMT'",
		"image": "src/img/media/groinfrick.png",
		"url": "https://github.com/mininmobile/groinfrick"
	},
	{
		"title": "How I learned 3D modelling",
		"page": "how-i-learned-3d-modelling",
		"content": [
			"i got into 3D modelling after watching <a class='external' href='https://www.youtube.com/watch?v=1qSTcxt2t74'>this</a> talk by Captain Disillusion, in it he mentions how the open source 3d modelling software blender has gotten a new update that completely revamped the user interface and to try it if you've tried it before but the ui was too complicated.",
			"so, i bit the bullet and started binging the donut tutorial series by the blender guru, and the result turned out way better then i had expected and it was way easier then i expected, too! since then i have logged a good 63 hours on blender on steam... highly recommended if you're into that kind of thing."],
		"type": "text",
		"date": "Wed, 25 Mar 2020 02:14:36 GMT",
		"image": "src/img/media/how_3d.png",
		"url": "https://www.youtube.com/playlist?list=PLjEaoINr3zgEq0u2MzVgAaHEBt--xLB6U"
	},
	{
		"title": "Ranch",
		"page": "art-ranch",
		"type": "art",
		"date": "Sat, 21 Mar 2020 03:11:00 GMT",
		"image": "media/art_ranch.jpg",
		"url": "https://toot.cafe/@zvava/103858852106856874"
	},
	{
		"title": "odko",
		"page": "odko",
		"type": "project",
		"date": "Sun, 26 Jan 2020 12:18:09 GMT",
		"image": "src/img/media/odko.png",
		"url": "https://github.com/mininmobile/odko"
	},
	{
		"title": "Forest",
		"page": "art-ball",
		"type": "art",
		"date": "Fri, 17 Jan 2020 21:49:00 GMT",
		"image": "media/art_ball.jpg",
		"url": "https://toot.cafe/@zvava/103839622127164751"
	},
	{
		"title": "Abandon",
		"page": "art-abandon",
		"type": "art",
		"date": "Sat, 25 Jan 2020 23:40:00 GMT",
		"image": "media/art_abandon.jpg",
		"url": "https://toot.cafe/@zvava/103546592870465253"
	},
	{
		"title": "Forest",
		"page": "art-forest-old",
		"content": [
			"on reflection, here is where is where i think i finally started to hone into my style. i was creating more 'elaborate' renders, i haven't discovered adaptive subdivision yet so that's why the ground almost looks a little too smooth or just like flat, yk.",
			"\"i discovered poliigon by the blender guru from his blender tutorials as he promoted the hell out of it, and it has quite a lot of free photo-real textures and i tried something out with it, probably am not making the best use of them but w/e. this was still fun to make.\""],
		"type": ["art", "text"],
		"date": "Sat, 25 Jan 2020 02:19:00 GMT",
		"image": "media/art_forestold.jpg",
		"url": "https://toot.cafe/@zvava/103541557870041457"
	},
	{
		"title": "Ball",
		"page": "art-ball",
		"type": "art",
		"date": "Fri, 17 Jan 2020 21:49:00 GMT",
		"image": "media/art_ball.jpg",
		"url": "https://toot.cafe/@zvava/103500859326746646"
	},
	{
		"title": "Poop Replacement Therapy",
		"page": "poop-replacement-therapy-concept",
		"content": [
			"i made this render in blender and added some cool dashed lines in paint.net afterwards. this and \"ball\" were the only two pieces i made in this style but i think they both turned out pretty well. this also began my journey of posting funky abstract pieces.",
			"this was also supposed to be album art but, lets be honest, i'll probably never finish the album",
			"\"making some experimental album called poop replacement therapy, probably will complete it more then half way through the year if i remember lol. i suck at long term projects especially when a lot of school work is in the way.\""],
		"type": ["art", "text"],
		"date": "Tue, 14 Jan 2020 22:32:00 GMT",
		"image": "media/poop_replacement_therapy.jpg",
		"url": "https://toot.cafe/@zvava/103484039487756696"
	},
	{
		"title": "Glitch Art 2",
		"page": "glitch-art-2",
		"type": "art",
		"date": "Sun, 08 Sep 2019 15:58:00 GMT",
		"image": "media/glitch_art_2.jpg",
		"url": "https://twitter.com/pasinazera/status/1171140014518001664"
	},
	{
		"title": "Glitch Art 1",
		"page": "glitch-art-1",
		"type": "art",
		"date": "Sun, 08 Sep 2019 15:58:00 GMT",
		"image": "media/glitch_art_1.jpg",
		"url": "https://twitter.com/pasinazera/status/1170713098786922497"
	},
	{
		"title": "Glitch Art 0",
		"page": "glitch-art-0",
		"content": "back in september of 2019 i made a few pieces of glitch art with a few apps i found while just browsing on the play store, here is the first in the series of three that i squirt out.",
		"type": "art",
		"date": "Sun, 08 Sep 2019 00:32:00 GMT",
		"image": "media/glitch_art_0.jpg",
		"url": "https://twitter.com/pasinazera/status/1170480049071562752"
	},
	{
		"title": "no suck",
		"page": "no-suck",
		"type": "video",
		"date": "Wed, 29 May 2019 00:00:00 GMT",
		"url": "https://www.youtube.com/watch?v=CNkx3oz7_9g",
		"length": "00:09"
	},
	{
		"title": "zvava - I'm not racist but",
		"page": "im-not-racist-but",
		"content": [
			"imma just put it out there and say that i like dark humor, i don't condone killing babies and stuff but if you phrase it in the right way i'll laugh.",
			"i made this partial cover of a song that i thought was a funny. i don't think it's funny because of its content but rather intelligently crafted, quoting the opening lyric, 'my dick is shaped like a rectangular prism, you know i love molesting kids with autism' - who rhymes prism with autism? god i love this song,,"],
		"type": "song",
		"date": "Sun, 10 Mar 2019 00:00:00 GMT",
		"image": "src/img/media/im_not_racist_but.png",
		"url": "https://soundcloud.com/pasinazera/im-not-racist-but",
		"length": "01:36",
		"explicit": true
	},
	{
		"title": "minin --> zvava",
		"page": "minin-zvava",
		"content": "zvava, my current alias, is actually a rot13 of my previous alias minin. i came up with minin when i was 7 years old and coming up with a name for my minecraft youtube channel, so what'd be better name for a minecraft youtuber then the word mining but without the g? (pronounced like minin') inbetween zvava and minin was 'minin gamer' which actually came first but i knocked off the gamer some time later.",
		"type": ["text", "old"],
		"date": "Mon, 30 Mar 2020 01:56:44 GMT"
	},
	{
		"title": "Xonade",
		"page": "xonade-terminal",
		"content": [
			"xonade was another <a href='media.html?page=batch'>batch</a> terminal project i made back in 2016 or 2017, the newest old date i have for it is october of 2018 when i pushed it to github for a rewrite in powershell. it was supposed to be a self replicating batch os with the ability to load plugins, essentially giving it unlimited expandability.",
			"there were only three plugins i wrote for it, firsly an example plugin that was just hello world, an account manager like in <a href='media.html?page=batch-system-administrator-old'>B.S.A.</a>, i assume this was supposed to be an api that could be used by other plugins/apps but im not quite sure. lastly i wrote a basic credit card management system that would allow the user to create and manage virtual credit cards in, for example, a classroom economy.",
			"the 2018 rewrite was made after i discovered powershell and wanted to rewrite xonade in it cause i thought it would be a simple project - of course i had to make a custom \"x\" scripting language for it which is why i gave up on it."
		],
		"type": "project",
		"date": "Mon, 16 Oct 2018 00:00:00 GMT",
		"image": "src/img/media/terminal.png",
		"url": "https://github.com/mininmobile/xonade"
	},
	{
		"title": "Where's The Storage?",
		"page": "wheres-the-storage-old",
		"content": [
			"where's the storage (better written as wts, a play on wtf) started off as a <a class='external' href='https://www.youtube.com/watch?v=NO_gqbE3e54'>hard drive activity light</a> but i had expanded it into a ccleaner clone. it was written in C#.net winforms and utilized <a href='media.html?page=murpe-update-old'>murpe</a> for updates",
			"after the tutorial i added a ui which could scan and list locations on your computer which contain junk data and could also run a batch file which cleared out junk data in those locations.",
			"i think this idea could have gone places, and i was indeed working on a whole revamp but soon after i forgot about the project, email me if you would like me to publish the source code anywhere if you're curious",
			"screenshot included in the download link"
		],
		"type": ["project", "old"],
		"date": "Mon, 24 Apr 2017 18:25:54 GMT",
		"url": "https://mega.nz/#F!1F1yRIQD!fosK8sVxMKpz6R8RwJxE3Q"
	},
	{
		"title": "Zebra Pad",
		"page": "zebra-pad-old",
		"content": [
			"zebra pad is my notepad app originally made in <a href='media.html?page=pika-software-builder'>pika software builder</a> on march of 2017 but \"remastered\" in C#.net winforms on the august of 2017. it utilized <a href='media.html?page=murpe-update-old'>murpe</a> for updates.",
			"version 1.0 features a big textbox for your words and a custom window bar with an update button on the left which linked to zebra pad's murpe update page, a text bar for naming the file in the center, and mac os styled stoplights on the right. the green button saved the file in documents with the name given in the textbox, the yellow button minimizes the application to taskbar, and the red button cleared the content textbox.",
			"version 1.1 was built on the same day as 1.0 and removes the file name textbox as it didn't work. it just saves a 'New Text Document.txt' in your documents folder lmfao",
			"version 1.2 was a complete revamp in C#.net with winforms for gui, and im still a little proud of it to this day - back then i was proud of it enough to make a whole <a class='external' href='https://alternativeto.net/software/zebra-pad/'>alternativeto.net</a> page for it. if you want some screenshots of how it looked like they're there, email me if they've taken it down cause i bet it's not long until they discover it's discontinued. :P i have archived the screenshots on there in the download link too in case"
		],
		"type": "old",
		"date": "Mon, 13 Mar 2017 18:46:19 GMT",
		"image": "src/img/media/zebrapad.png",
		"url": "https://mega.nz/#F!9A9nlDIZ!-7Lv5yel_fOgO_sil2dX8g"
	},
	{
		"title": "Minin Hub",
		"page": "minin-hub-old",
		"content": [
			"minin hub was a web browser except it is only able to access the minin productions homepage. (now defunct) it was my first application to use <a href='media.html?page=murpe-update-old'>murpe</a> for updates",
			"back in the good old days of having my head far up my own ass i thought that people would download a program made specifically to view my website - not even offline or anything. but i mean i never tried to catch traction for any of my things i just did it for fun and i guess that's what everything should be about, right?",
			"screenshot included in download link"
		],
		"type": "old",
		"date": "Sat, 11 Mar 2017 20:39:43 GMT",
		"url": "https://mega.nz/#F!tc0FFRSD!Vmz-070pPfQ4wNGbfXUPsg"
	},
	{
		"title": "Alex Ferro - You (Itro Remix) (zvava Remix)",
		"page": "you-remix",
		"content": "a little remix i made in audacity, back in 2015-17 i was really into basic mashing of songs and this is the only one i'll leave up cause it actually kinda slaps.",
		"type": ["song", "old"],
		"date": "Mon, 03 Oct 2016 00:00:00 GMT",
		"url": "https://soundcloud.com/pasinazera/you-itro-remix-vapor-remix",
		"length": "02:50"
	},
	{
		"title": "murpe Update System",
		"page": "murpe-update-old",
		"content": [
			"murpe is an update system i had devised in march of 2017 to use in minin productions applications, from the archives i only have evidence of <a href='media.html?page=minin-hub-old'>minin hub</a>, <a href='media.html?page=zebra-pad-old'>zebra pad</a>, and <a href='media.html?page=wheres-the-storage-old'>wts</a> utilizing murpe but there may be more.",
			"i forgot what it stood for soon after i named it but i can only assume it stands for Minin Update Release Platform Environment or something like that. it was hosted on a shady free hosting website",
			"the way it works is there would be php files with the names of the applications, eg. 'zebrapad.php', and then an application would pass a <a class='external' href='https://en.wikipedia.org/wiki/Query_string'>GET parameter</a> to the php file with the version, eg. '?ver=1.2'. then the page would report if you have the latest version of the program or not, and redirect to the download page for the program."
		],
		"type": "old",
		"date": "Tue, 31 Mar 2020 00:54:34 GMT"
	},
	{
		"title": "Minin Productions",
		"page": "minin-productions-old",
		"content": [
			"Minin Productions was the name of a 'company' that i had founded in 2015 (maybe 2014 but i don't have any archives) to list all or most of my projects under which i didn't feel like associating with myself personally for some reason.",
			"it was renamed from \"Minin Inc.\" sometime around 2016 or 2017 as i had several \"brands\" like Minin Arts and MininMusic for my creative outlets and i wanted to unify them all since they were seperate for no good reason."],
		"type": ["text", "old"],
		"date": "Mon, 30 Mar 2020 02:50:28 GMT"
	},
	{
		"title": "Piko OS",
		"page": "pikaos-pikoos-old",
		"content": [
			"piko os was meant to be a <a href='media.html?page=pika-software-builder'>pika software builder</a> os, hence the name. it is slightly special to me because it was the first time i (tried to) use git/github",
			"it uses batch for authentication and the menus are made in pika. the way the login system works is that once you press the login button, what you type into the username/password fields is saved to a batch file which when ran sets two variables with the username and password, then it runs another batch file to check the username against 'admin' and password against 'login'. if the check succeeds then it runs desktop.exe",
			"inside, there is a menu button on the desktop which launches desktopMenu.exe which shows the desktop but with a start menu appearing in the top right. you can either hide the menu, going back to desktop.exe, or \"poweroff\" to close piko",
			"piko was the first time i actually tried to use git/github's desktop application to try and create/manage a repository. it didn't really work out but im pretty sure i got it up on there somehow",
			"screenshots provided in the download link"
		],
		"type": "old",
		"date": "Sun, 31 Jan 2016 23:21:35 GMT",
		"url": "https://mega.nz/#F!gJ1glK4C!Z1NUX2tEzLR-RuWHZMG16w"
	},
	{
		"title": "Quickpad",
		"page": "quickpad-old",
		"content": [
			"quickpad is a notepad application made in <a href='media.html?page=pika-software-builder'>pika software builder</a> as a precursor to <a href='media.html?page=zebra-pad-old'>zebra pad</a>. it was an application where you could quickly jot down notes and save them quickly and easily.",
			"but really, it was supposed to be a full notepad application until i ran into the limitations of pika and had to compromise and then i acted like that was how i meant it to be all along.",
			"it featured one whole textbox and one dropdown in the menu bar which was 'File', the only option it contained was 'Save' which would create/overwrite a file on your desktop called 'quickpaddocument.txt' with the contents of the textbox."
		],
		"type": "old",
		"date": "Tue, 15 Dec 2015 22:53:34 GMT",
		"image": "src/img/media/quickpad.png",
		"url": "https://mega.nz/#F!hUVUWYSK!znM0R0FBViVvvCTCNgtAwQ"
	},
	{
		"title": "Batch System Administrator",
		"page": "batch-system-administrator-old",
		"content": [
			"batch system administrator, aka B.S.A., was a problem for a solution. it was a cover for a <a href='media.html?page=batch'>batch</a> user management system (you could make an account and log in and stuff) and im pretty sure it was the first time i made one of those.",
			"the user system worked like so; when registering you would input a username and password and then they would be saved as a batch file with the file name as the username, when run that file would set username and password variables. if you were trying to log in you would be asked for a username and password, then if the user file existed it would be run and the password would be checked.",
			"once you had logged in you had four options. 1) load a plugin, the plugin system was basically you entering a word and B.S.A. would try to run a batch file with the name of that word in the /plugins/ folder 2) current comp starts would just list some environment variables 3) edit personal data, i added a notepad into this thing where you could create multiple files and each \"personal data\" would be password protected, you needed a password to view or edit the data. (this was kinda dope too ngl) 4) view dev info and credits, this option was just listing some autobiographical stuff... but i wrote it 5 years ago so it's hilarious",
			"if i had to pick a favorite project from 2015 - i don't think i could choose but if i could it might be B.S.A., it just holds a special place in my heart for some odd reason. (while writing this i had discovered that i had made the main code modular too - that's dope as fuck!) i'd also like to say it was a spiritual precursor to <a href='media.html?page=xonade-terminal'>xonade</a> but im not sure how much it actually was lol"
		],
		"type": "old",
		"date": "Fri, 17 Jul 2015 12:24:00 GMT",
		"url": "https://mega.nz/#F!4V0DlBRZ!_IVhlLrXeFJAyeY6WxK-IQ"
	},
	{
		"title": "Eterm",
		"page": "eterm-old",
		"content": [
			"eterm was a \"custom terminal\" i wrote in <a href='media.html?page=batch'>batch</a>, according to the last modified date it was created in the april of 2015. i think the purpose of these batch terminal projects was to abstract the commands of the default windows terminal (cmd.exe) but i think it ends up being more use to use this over learning cmd. (as im pretty sure it was built to make you look like a cool hacker and not to actually function well)",
			"the only notable part of this terminal that i think was pretty interesting was the \"path system\", in the code, the 'help/paths/...' command tells you the available paths and you would be able to use commands along the lines of 'gt/main/...' to go to the paths - there is only one path implemented and that's the start of the program but i still think the idea had merit."
		],
		"type": "old",
		"date": "Mon, 06 Apr 2015 15:01:20 GMT",
		"image": "src/img/media/terminal.png",
		"url": "https://gist.github.com/mininmobile/2f7c9a8d9278826352b1d86a21add68d"
	},
	{
		"title": "Desktop Replacer",
		"page": "deskreplacer-old",
		"content": [
			"deskreplacer/desktop replacer was a utility i made with <a href='media.html?page=pika-software-builder'>pika software builder</a> with the purpose of replacing the default windows desktop with an idiot proof and simplified version.",
			"the only archived version, 1.5, features a link to a google chrome shortcut and a link to a bundled version of <a href='media.html?page=fxweb-old'>fxweb</a> 2.2 on the desktop under the text \"welcome\". in the top right corner was a close button and in the bottom right was a theme selector button which let you choose a different wallpaper",
			"i remember that in earlier versions i instead bundled fxweb minimal which is still in the folder instead of full 2.2, the minimal version of fxweb was actually created specifically for deskreplacer",
			"screenshots included in download link"
		],
		"type": "old",
		"date": "Sat, 25 Apr 2015 20:16:12 GMT",
		"image": "src/img/media/desktopreplacer.png",
		"url": "https://mega.nz/#F!1RcwzIBK!VU1q_72fS4EhbgKC411gsw"
	},
	{
		"title": "FXweb",
		"page": "fxweb-old",
		"content": [
			"fxweb was a web browser made in <a href='media.html?page=pika-software-builder'>pika software builder</a>, one of the simplest projects you could do in pika - but i think v2 actually did some neat and cool things;",
			"version 2.2, which is the latest and only archive i have of a regular fxweb release, is just a regular release of fxweb with a supporting website that is now down. the supporting website (startup.miningamer.info, my old domain was miningamer.info and startup was a subdomain dedicated to fxweb) featured as a 'new tab page' for fxweb where you could have a customizable tab page, store bookmarks, etc., none of this was implemented of course and it doesn't even exist anymore as i stopped renewing miningamer.info. i still think it was a pretty cool idea though...",
			"there was also a minimal version of fxweb created for <a href='media.html?page=deskreplacer-old'>deskreplacer</a>, the minimal version was a small non-resizable window of which i didn't save the source code so once i realized i didn't wire up the controls of the browser i just left it, but i still have the exe for some reason!",
			"i think fxweb has to be one of if not my earliest released pika project. it was released probably around 2014 or really early 2015, although the date on this page reflects the release of fxweb 2.2 as i cannot find a file date that reflects the true release of fxweb."
		],
		"type": "old",
		"date": "Sun, 15 Nov 2015 12:21:38 GMT",
		"image": "src/img/media/fxweb.png",
		"url": "https://mega.nz/#F!xE1gjYIR!PTHGPg7c1tXwkZGXhiQPFg"
	},
	{
		"title": "Pika Software Builder",
		"page": "pika-software-builder",
		"content": [
			"pika software builder is a WYSIWYG editor for building windows applications. it was very easy to use and also heavily pirated which led to young me, not knowing any better, using it to create several apps probably illegally but learning much in the process - so thank you pika for existing i guess :P",
			"i assume pika went bankrupt as the website is offline and the fact that there was rampant piracy, so to satiate your interest i have an archive.org link here anyway;"
		],
		"type": "info",
		"date": "Tue, 31 Mar 2020 01:53:33 GMT",
		"image": "src/img/media/pikasoftwarebuilder.png",
		"url": "https://web.archive.org/web/20130523135808/http://www.pikaonline.com/psb"
	},
	{
		"title": "Batch",
		"page": "batch",
		"content": [
			"batch (.bat or .cmd) files are lists of ms dos commands with added branching via if, for, and goto statements. it is <a class='external' href='https://stackoverflow.com/questions/11126539/is-batch-turing-complete'>turing complete</a> so i will refer to it as a programming language",
			"batch was my second programming language to <a href='media.html?page=scratch'>scratch</a> and it thought me a lot about more conventional (non-gui) programming in my earlier years, sometimes i still write projects in it for the hell of it cause it's actually quite fun to write in."
		],
		"type": "info",
		"date": "Tue, 31 Mar 2020 23:42:16 GMT",
		"image": "src/img/media/windowsterminal.png",
		"url": "https://en.wikipedia.org/wiki/Batch_file"
	},
	{
		"title": "Scratch",
		"page": "scratch",
		"content": [
			"scratch is a functional, visual programming language that uses blocks to build projects, it is targetting primarily towards children.",
			"scratch was the first programming language i have ever learned. i started when i was signed up to the <a class='external' href='https://coderdojo.com/'>coderdojo</a> in athlone and since then i've become a complete nerd. thanks mom.",
			"really though, it has thought me the fundamentals on programming and from there on i learned <a href='media.html?page=batch'>batch</a> which thought me even more. somewhere inbetween there i learned html and css and thus javascript (plus some others) which brings me to where i am today!"
		],
		"type": "info",
		"date": "Sun, 06 Apr 2020 00:59:10 GMT",
		"url": "https://scratch.mit.edu"
	}
]
